Revit 2027 API
Metal.MetalPerforationsSize Property
 The property labeled "Diameter/Size" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPerforationsSize { get; }
Public Shared ReadOnly Property MetalPerforationsSize As String
	Get
public:
static property String^ MetalPerforationsSize {
	String^ get ();
}
static member MetalPerforationsSize : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" with a minimum of "0.0001".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace